starter-kit/lib/tasks/import.rake

  task locations: :environment do
    puts 'Importing locations...'
    csv_path = Rails.root.join('data/locations.csv')
    CSV.foreach(csv_path, headers: true) do |row|
      Location.find_or_initialize_by(name: row['name']).tap do |loc|
        loc.region = row['region']
        loc.coordinates = Location.point(row['lat'], row['lng'])
        loc.save!
      end
    end
    puts "Done: #{Location.count} locations."
---
SELECT "locations".* FROM "locations" WHERE "locations"."name" = 'Lisboa' LIMIT 1
INSERT INTO "locations" ("name", "region", "coordinates", "created_at", "updated_at") VALUES ('Lisboa', 'Lisboa', '0020000001000010e6c02247525460aa6540435c74538ef34d', '2026-04-20 17:59:30.842761', '2026-04-20 17:59:30.842761') RETURNING "id"
SELECT COUNT(*) FROM "locations"

  task pois: :environment do
    puts 'Importing POIs...'
    csv_path = Rails.root.join('data/pois.csv')
    CSV.foreach(csv_path, headers: true) do |row|
      poi = Poi.find_or_initialize_by(name: row['name'])
      poi.description  = row['description']
      poi.coordinates  = Poi.point(row['lat'], row['lng'])
      poi.save!

      category_names = row['categories'].to_s.split(',').map(&:strip).reject(&:empty?)
      category_names.each do |cat_name|
        category = Category.find_or_create_by!(name: cat_name)
        PoiCategory.find_or_create_by!(poi: poi, category: category)
      end
    end
    puts "Done: #{Poi.count} POIs, #{Category.count} categories."
---
SELECT "pois".* FROM "pois" WHERE "pois"."name" = 'Praia da Marinha' LIMIT 1
SELECT 1 AS one FROM "categories" WHERE "categories"."name" = 'beach' LIMIT 1
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('beach', '2026-04-20 17:59:30.917510', '2026-04-20 17:59:30.917510') RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'beach' LIMIT 1
INSERT INTO "pois" ("name", "description", "coordinates", "created_at", "updated_at") VALUES ('Praia da Marinha', 'One of the most iconic beaches in the Algarve with stunning cliff formations', '0020000001000010e6c020d2474538ef3540428b6e2eb1c433', '2026-04-20 17:59:30.909008', '2026-04-20 17:59:30.909008') RETURNING "id"
INSERT INTO "poi_categories" ("poi_id", "category_id", "created_at", "updated_at") VALUES (1, 1, '2026-04-20 17:59:30.929727', '2026-04-20 17:59:30.929727') RETURNING "id"
SELECT "poi_categories".* FROM "poi_categories" WHERE "poi_categories"."poi_id" = 1 AND "poi_categories"."category_id" = 1 LIMIT 1
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "pois"