starter-kit/app/models/poi.rb

SELECT "pois".* FROM "pois" ORDER BY ST_Distance(coordinates::geography, ST_SetSRID(ST_MakePoint(-9.1393, 38.7223), 4326)::geography) LIMIT 1
---
  def self.nearest(lat, lng)
    origin_sql = "ST_SetSRID(ST_MakePoint(#{lng.to_f}, #{lat.to_f}), 4326)::geography"
    order(Arel.sql("ST_Distance(coordinates::geography, #{origin_sql})")).first