starter-kit/app/controllers/api/v1/locations_controller.rb

      def index
        locations = Location.order(:name)
        render json: locations.map { |l| serialize_location(l) }
---
SELECT "locations".* FROM "locations" ORDER BY "locations"."name" ASC

      def show
        location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1