starter-kit/app/controllers/api/v1/locations_controller.rb

      def index
        locations = Location.order(:name)
---
SELECT "locations".* FROM "locations" ORDER BY "locations"."name" ASC

      def show
        location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]