starter-kit/app/controllers/api/v1/pois_controller.rb

        scope = Poi.includes(:categories).order(:name)
        if params[:category].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (6, 7, 8, 1)
SELECT "poi_categories".* FROM "poi_categories" WHERE "poi_categories"."poi_id" IN (100, 51, 28)

      def serialize_poi(poi)
        {
          id: poi.id,
          name: poi.name,
          description: poi.description,
          lat: poi.coordinates&.y,
          lng: poi.coordinates&.x,
          categories: poi.categories.map(&:name)
---
SELECT "categories".* FROM "categories" INNER JOIN "poi_categories" ON "categories"."id" = "poi_categories"."category_id" WHERE "poi_categories"."poi_id" = 70