starter-kit/app/controllers/api/v1/pois_controller.rb

        scope = Poi.includes(:categories).order(:name)
---
SELECT "poi_categories".* FROM "poi_categories" WHERE "poi_categories"."poi_id" IN ($1, $2)  [["poi_id", 14], ["poi_id", 13]]

      def show
        poi = Poi.includes(:categories).find(params[:id])
---
SELECT "poi_categories".* FROM "poi_categories" WHERE "poi_categories"."poi_id" = $1  [["poi_id", 17]]
SELECT "pois".* FROM "pois" WHERE "pois"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]