starter-kit/app/controllers/api/v1/trips_controller.rb

      def plan
        origin      = Location.find_by(id: params[:origin_id])
        destination = Location.find_by(id: params[:destination_id])
        limit       = params.fetch(:limit, 5).to_i.clamp(1, 50)
        categories  = params[:categories].presence&.split(',')&.map(&:strip)

        errors = []
        errors << 'origin_id not found' unless origin
        errors << 'destination_id not found' unless destination
        return render json: { errors: errors }, status: :unprocessable_content if errors.any?

        route_geojson = fetch_osrm_geometry(origin, destination)

        pois = if route_geojson
                 Poi.along_road_route(origin, destination, route_geojson: route_geojson, limit: limit,
                                                           categories: categories)
               else
                 Poi.along_route(origin, destination, limit: limit, categories: categories)
               end
        pois = pois.preload(:categories)

        all_waypoints = [[origin.coordinates.x, origin.coordinates.y]] +
                        pois.map { |p| [p.coordinates.x, p.coordinates.y] } +
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "poi_categories" ON "categories"."id" = "poi_categories"."category_id" WHERE "poi_categories"."poi_id" = $1  [["poi_id", 2]]